# ===== Core Tools =====
brew "zsh"
brew "neovim"
brew "git"
brew "direnv"
brew "mise"
brew "rbenv"

# ===== Languages & Runtimes =====
# Most versions managed by mise, but these provide system-level support
brew "deno"
brew "pnpm"

# ===== Build Dependencies =====
# Needed for compiling Python packages with native extensions
brew "zlib"
brew "bzip2"
brew "openssl"
brew "libomp"
brew "openblas"
brew "mysql-client"

# ===== Casks =====
# Uncomment the apps you want installed
cask "cursor"
cask "docker"
cask "firefox"
cask "google-chrome"
# cask "slack"
# cask "obsidian"
# cask "dropbox"
