# ===== Core Tools =====
brew "zsh"
brew "neovim"
brew "git"
brew "direnv"
brew "mise"
brew "rbenv"

# ===== Languages & Runtimes =====
# Most versions managed by mise, but these provide system-level support
brew "deno"
brew "pnpm"

# ===== Build Dependencies =====
# Needed for compiling Python packages with native extensions
brew "zlib"
brew "bzip2"
brew "openssl"
brew "libomp"
brew "openblas"

# ===== Casks =====
cask "font-fira-code"
cask "cursor"
cask "docker-desktop"
cask "firefox"
cask "google-chrome"
cask "raycast"
cask "rectangle"
cask "slack"
# cask "obsidian"
# cask "dropbox"
