aaron-bond.better-comments
anysphere.cursorpyright
astral-sh.ty
astro-build.astro-vscode
asvetliakov.vscode-neovim
bradlc.vscode-tailwindcss
charliermarsh.ruff
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
denoland.vscode-deno
donjayamanne.githistory
eamodio.gitlens
esbenp.prettier-vscode
ex-codes.pine-script-syntax-highlighter
golang.go
graphql.vscode-graphql
graphql.vscode-graphql-execution
graphql.vscode-graphql-syntax
gruntfuggly.todo-tree
hashicorp.terraform
hediet.vscode-drawio
hverlin.mise-vscode
jpoissonnier.vscode-styled-components
juanblanco.solidity
llvm-vs-code-extensions.vscode-clangd
mechatroner.rainbow-csv
meganrogge.template-string-converter
mikestead.dotenv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode.remote-explorer
njpwerner.autodocstring
nyxb.vscode-styled-colors
orta.vscode-jest
oxc.oxc-vscode
philstainer.git-worktree
pkief.material-icon-theme
quicktype.quicktype
qwtel.sqlite-viewer
rust-lang.rust-analyzer
shopify.ruby-lsp
spmeesseman.vscode-taskexplorer
svelte.svelte-vscode
tintinweb.solidity-metrics
tintinweb.vscode-decompiler
tintinweb.vscode-solidity-language
tombi-toml.tombi
unifiedjs.vscode-mdx
usernamehw.errorlens
vitest.explorer
vscodevim.vim
wix.vscode-import-cost
yoavbls.pretty-ts-errors